using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Media.Imaging;
using VariableLibrary.Services;

namespace VariableLibrary.Models
{
    public class Book : IModel
    {
        public int Id { get; set; }
        public string Title { get; set; }
        public string Description { get; set; }
        public int GenreId { get; set; }
        public int AuthorId { get; set; }
        public string Rating { get; set; }
        public string FileName { get; set; }

        public BitmapImage Image
        {
            get
            {
                var bitmap = new BitmapImage();
                bitmap.BeginInit();
                bitmap.CacheOption = BitmapCacheOption.OnLoad;
                bitmap.UriSource = new Uri($"pack://application:,,,/VariableLibrary;component/BookImages/{FileName}", UriKind.Absolute);
                bitmap.EndInit();
                return bitmap;
            }
        }

        public BookGenre Genre
        {
            get
            {
                return DBService.Instance.GetModelData<BookGenre>().FirstOrDefault(x => x.Id == GenreId);
            }
        }

        public Author Author
        {
            get
            {
                return DBService.Instance.GetModelData<Author>().FirstOrDefault(x => x.Id == AuthorId);
            }
        }

        public Book()
        {

        }

        public Book(int id, string title, string description, int genreId, int authorId, string rating, string fileName)
        {
            Id = id;
            Title = title;
            Description = description;
            GenreId = genreId;
            AuthorId = authorId;
            Rating = rating;
            FileName = fileName;
        }

        public List<IModel> GenerateData()
        {
            return new List<IModel>() { new Book(1, "Записки юного врача", "Истории, основанные на личном опыте Булгакова, — о внутренней борьбе и сострадании к ближнему, о чувстве долга и о надежде даже в самых отчаянных обстоятельствах.\r\n\r\nМолодого врача, только что окончившего университет, направляют работать в больницу в глуши. Там, один на один со сложными случаями, дремучестью пациентов и тяжелым каждодневным трудом, ему предстоит борьба с собственными страхами и сомнениями. \"Записки юного врача\" — гимн (и одновременно реквием) земской медицине, где герой балансирует между подвижничеством и отчаянием.", 4,1,"★★★★★", "1.png"),
                                        new Book(2, "Мастер и Маргарита", "Москвичи 1930-х годов и свита дьявола, прокуратор Иудеи Понтий Пилат и философ Иешуа Га-Ноцри, талантливый и сумасшедший мастер и его возлюбленная Маргарита, ставшая ведьмой. Сатира на советское общество, библейский сюжет, бал сатаны. Многоуровневый и многогранный роман Михаила Булгакова уже не одно десятилетие ставит перед читателями вопросы и заставляет иначе взглянуть на самих себя.", 4,1,"★★★★☆", "2.jpg"),
                                        new Book(3, "Сияние", "…Проходят годы, десятилетия, но потрясающая история писателя Джека Торранса, его сынишки Дэнни, наделенного необычным даром, и поединка с темными силами, обитающими в роскошном отеле «Оверлук», по-прежнему завораживает и держит в неослабевающем напряжении читателей самого разного возраста…", 2,2,"★★★★☆", "3.jpg"),
                                        new Book(4, "Зеленая миля", "Роман-событие, ставший лауреатом премии Брэма Стокера и вдохновивший Фрэнка Дарабонта на создание культового фильма, в котором Том Хэнкс сыграл, возможно, свою лучшую роль.\r\n\r\n…Стивен Кинг приглашает читателей в жуткий мир тюремного блока смертников, откуда уходят, чтобы не вернуться, приоткрывает дверь последнего пристанища тех, кто преступил закон и теперь отсчитывает последние часы...\r\nДо предела обнажены нервы, накалены страсти и обострены чувства. Уже ничего нельзя исправить — последняя черта совсем близко. Но еще можно понять и посочувствовать тем, кому предстоит отправиться по зловещей Зеленой миле в никуда…", 3,2,"★★★★☆", "4.jpg"),
                                        new Book(5, "Идиот", "Величайший роман Достоевского.\r\n«Идиота» экранизировали 13 раз лучшие постановщики от Индии до Германии — Жорж Лампен и Анджей Жулавский, Акира Куросава и Анджей Вайда, отечественные Пырьев и Бортко.\r\nЗавораживающая история трагических страстей, связавших купца Парфена Рогожина, бывшую содержанку богатого дворянина Настасью Филипповну и «идеального человека» князя Мышкина — беспомощного идиота в мире корысти и зла, гласящая о том, что сострадание, возможно, единственный закон человеческого бытия. Она по-прежнему актуальна и воспринимается ярко и непосредственно, будто была написана вчера.", 6,3,"★★★★☆", "5.jpg"),
                                        new Book(6, "Преступление и наказание", "\"Преступление и наказание\" (1866) — одно из самых значительных произведений в истории мировой литературы. Это и глубокий филососфский роман, и тонкая психологическая драма, и захватывающий детектив, и величественная картина мрачного города, в недрах которого герои грешат и ищут прощения, жертвуют собой и отрекаются от себя ради ближних и находят успокоение в смирении, покаянии, вере. Главный герой романа Родион Раскольников решается на убийство, чтобы доказать себе и миру, что он не \"тварь дрожащая\", а \"право имеет\". Главным предметом исследования писателя становится процесс превращения добропорядочного, умного и доброго юноши в убийцу, а также то, как совершивший преступление Раскольников может искупить свою вину.", 6,3,"★★★★☆", "6.jpg"),
                                        new Book(7, "Гарри Поттер и узник Азкабана", "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Дж.К. Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и узник Азкабана» – история продолжается.\r\n3 причины купить:\r\n1. Культовая классика современной детской литературы.\r\n2. Захватывающая история, от которой невозможно оторваться.\r\n3. Именно благодаря этим книгам дети начинают читать, понимать и любить литературу.", 7,4,"★★★★☆", "7.jpg"),
                                        new Book(8, "Гарри Поттер и Философский камень", "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Джоан Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Философский камень» - история начинается.", 7,4,"★★★★☆", "8.jpg"),
                                        new Book(9, "Десять негритят", "Десять никак не связанных между собой людей в особняке на уединенном острове... Кто вызвал их сюда таинственным приглашением? Зачем кто-то убивает их, одного за другим, самыми невероятными способами? Почему все происходящее так тесно переплетено с веселым детским стишком?", 8,5,"★★★★☆", "9.jpg"),
                                        new Book(11, "Смерть на Ниле", "На роскошном пароходе «Карнак», плывущем по Нилу, убита молодая миллионерша, недавно вышедшая замуж и, как выяснилось, имевшая множество врагов среди пассажиров. Любой мог убить самоуверенную и нагловатую девушку, укравшую жениха у лучшей подруги. Но ни один из вероятных подозреваемых не совершал этого преступления… К счастью, на пароходе находится великий сыщик Эркюль Пуаро, который знает все общество, представленное в круизе, еще по Лондону и в курсе возможных мотивов каждого из присутствующих. И, конечно, первое, о чем задумывается бельгиец — это о «любовном треугольнике», состоявшем из убитой, ее свежеиспеченного мужа и очень темпераментной женщины, которую тот бросил ради миллионерши…", 8,5,"★★★★☆", "11.jpg"),
                                        new Book(12, "Анна Каренина", "\"Анну Каренину\" по праву называют самым известным и популярным в мире романом о любви.\r\n\"Огромная разработка души человеческой\", как отзывался о книге Достоевский, — вот, наверное, что больше всего подкупает нас в этой книге.\r\nИстория всепоглощающей страсти, история замужней женщины, полюбившей красавца офицера и бросившей своего мужа наперекор всему: мнению света, общепринятой морали, своей совести.\r\n\"Анну Каренину\" экранизировали 30 раз, музыку к балету писали Чайковский и Родион Щедрин, главную героиню в кино играли Грета Гарбо и Вивьен Ли, Алла Тарасова и Татьяна Самойлова, Софи Марсо и Кира Найтли.\r\nЭта книга, конечно, гораздо больше, чем просто роман о любви, это целая наука о семье, об обществе и о жизни.", 9,6,"★★★★☆", "12.jpg"),
                                        new Book(13, "Война и мир том I", "Писать о сюжете романа-эпопеи — авантюрная затея. Есть эпические шансы не уложиться в ограниченное количество строк. Поэтому опишем «Войну и мир» как физики, а не лирики. Ведь физики лаконичны даже тогда, когда говорят о Вселенной. Итак, Кутузов и Наполеон — это два магнитных полюса. Пусть отдельные силовые линии в пространстве между ними будут действующими лицами романа. Таких насчитывается 569. В это число входят все классы общества, все возрасты и характеры; автор анализирует их жесты, мимику и даже мысли. А общее магнитное поле условимся считать народом, или, в зависимости от проявления его в романе, толпой.\r\nВся эта чудесная физика взаимодействует и живет в объеме одной книги, но всегда дарит новые подробности наблюдателю, как если бы он пристально вглядывался в вещи и видел за молекулами атомы, а за ними — элементарные частицы. И затем бы укладывал увиденное в общую картину мира и словно бы чувствовал странный магнетизм — но уже не приборами, а самой душой.", 4,6,"★★★★☆", "13.jpg"),
                                        new Book(14, "Повести Белкина", "Обращение Пушкина к прозе было обдуманным шагом, которому предшествовали размышления о природе словесного искусства. И вполне возможно, что интерес первого русского поэта к прозе основывался на ощущении небывалой серьезности задач, стоящих перед русской литературой.", 6,7,"★★★★☆", "14.jpg"),
                                        new Book(15, "Евгений Онегин", "\"Евгений Онегин\" (1823-1831) – одно из самых значительных произведений русской литературы.\r\nПронзительная любовная история, драматические повороты сюжета, тонкий психологизм персонажей, детальное описание быта и нравов той эпохи (не случайно Белинский назвал роман \"энциклопедией русской жизни\") – в этом произведении, как в зеркале, отразилась вся русская жизнь. \"Евгений Онегин\" никогда не утратит своей актуальности, и даже спустя два века мы поражаемся точности и верности \"ума холодных наблюдений и сердца горестных замет\" великого русского поэта.\r\nВ сборник включены также драма \"Борис Годунов\" и цикл коротких пьес \"Маленькие трагедии\".", 9,7,"★★★★☆", "15.jpg"),
                                        new Book(16, "Приключения Шерлока Холмса", "Прошло уже больше ста лет с того момента, как был напечатан первый рассказ о Шерлоке Холмсе, а читатели всего мира по-прежнему с упоением погружаются в мир интереснейших опасных приключений, особую прелесть которых составляет твердая уверенность в том, что все закончится хорошо, ведь рассказов-то – несколько дюжин!\r\n\r\nИтак, два полных авторских сборника – «Приключения Шерлока Холмса» и «Возвращение Шерлока Холмса». Здесь будут жених, опасающийся мести бывшей возлюбленной, и невеста, брошенная в день венчания; загадочные апельсиновые зернышки и тайный код пляшущих человечков, смертоносный китобойный гарпун и рождественский гусь с сюрпризом… Но главное – главное, что здесь будет, – это удивительная атмосфера старой доброй Англии со всеми ее красками, запахами и звуками. И даже если вы знаете наизусть все истории о знаменитом дуэте, вы все равно не сможете отказать себе в удовольствии в который раз открыть книгу, а вместе с ней – и знакомую дверь на Бейкер-стрит, 221-b.", 8,8,"★★★★☆", "16.jpg"),
                                        new Book(17, "Собака Баскервилей", "В этот сборник вошли два романа Конан Дойла о приключениях бессмертного тандема с Бейкер-стрит, 221-б, – великого сыщика Шерлока Холмса и его друга и ассистента доктора Уотсона.\r\n«Собака Баскервилей» – наверное, самое знаменитое из произведений о Шерлоке Холмсе. Вот уже второе столетие все новые поколения читателей с неизменным восторгом и увлечением следят за расследованием дела о жестоком преступлении, изощренно замаскированном под таинственную легенду о демонической собаке, которая преследует древний аристократический род Баскервилей за ужасные деяния одного из его представителей…\r\n«Долина ужаса» – роман, в нашей стране издававшийся довольно редко. Однако в нем есть особое своеобразие, ведь это едва ли не единственное произведение о Шерлоке Холмсе, написанное на основе реальных событий.\r\nИтак, в своем поместье убит некий мистер Дуглас – так считает полиция. Холмс же уверен: жертва – не мистер Дуглас, а человек, собиравшийся с ним расправиться. Но за что? И куда и почему исчез сам хозяин дома?..", 8,8,"★★★★☆", "17.jpg"),
                                        new Book(18, "Хоббит", "\"В земле была нора, а в норе жил хоббит\". Эти слова написал Джон Рональд Руэл Толкин на обороте школьной экзаменационной работы, которую проверял одним жарким летним днем. И кто бы мог подумать, что именно из них, как из волшебного зернышка, произрастет одно из самых известных произведений мировой литературы.\r\n\r\nЭта сказка, покорившая и детей, и взрослых, отправляет читателя в невероятное путешествие, дарит незабываемое ощущение первозданного детского восторга и добра.", 1,9,"★★★★★", "18.jpg"),
                                        new Book(19, "Властелин Колец", "Международный бестселлер. Одна из самых известных книг XX века. Один из родоначальников жанра фэнтези.\r\nЛитературная основа кинотрилогии Питера Джексона.\r\nУвлекательная история о силе добра и борьбе с абсолютным злом.\r\nВсё это и многое больше — «Властелин колец».\r\nВ данном издании все три части публикуются под одной обложкой.", 1,9,"★★★★★", "19.jpg"),
                                        new Book(20, "Сильмариллион", "\"Сильмариллион\" – один из масштабнейших миров в истории фэнтези, мифологический канон, который Джон Руэл Толкин составлял на протяжении всей жизни. Свел же разрозненные фрагменты воедино, подготовив текст к публикации, сын Толкина Кристофер. В 1996 году он поручил художнику-иллюстратору Теду Несмиту нарисовать серию цветных произведений для полноцветного издания.", 1,9,"★★★★★", "20.jpg")};
        }
    }
}
